lang/python-distilled.org
#+TITLE: Python 编程语言精粹
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-23 Tue>
#+TAGS: python programming distilled


* 解释器的环境变量
** PYTHONDONTWRITEBYTECODE 是否写字节码文件

   阻止 Python 解释器生成二进制字节码文件，如 =__pycache__=, =*.pyc=, =*.pyo= 等

   #+BEGIN_SRC sh
     export PYTHONDONTWRITEBYTECODE=1
   #+END_SRC

   附将字节码一次性删除的命令

   #+BEGIN_SRC sh
     find . -type f -name "*.py[co]" -delete -or -type d -name "__pycache__" -delete
   #+END_SRC

** PYTHONPATH 系统的搜索路径

   Python 模块的搜索路径，可以通过 =sys.path= 变量查看
   #+BEGIN_SRC python :exports code
     >>> import sys
     >>> sys.path
     ['d:\\Python36\\DLLs', 'd:\\Python36\\lib', 'd:\\Python36', ...]
     >>>
   #+END_SRC

* 读取用户输入
** =raw_input= =input=
   Python3.x 里面已经把 =raw_input()= 给去掉了。事实上是这样的：在 Python3.x 内，
   将 =raw_input()= 重命名为 =input()= ，这样一来，无须导入也能从标准输入获得数
   据了。如果您需要保留版本 Python2.x 的 =input()= 功能，可以使用
   =eval(input())= ，效果基本相同。Python2.x 中， =raw_input()= 会从标准输入
   =sys.stdin= 读取一个输入并返回一个字符串，且尾部的换行符从末尾移除。其中关于
   读取用户输入的样例如下：

   #+BEGIN_SRC python :exports code
     import os, sys

     if __name__ == '__main__' :
       # read raw string
       name = raw_input('name = ')
       print('your name is ' + name)

       # read a expression, for example, integer
       age = input('age = ')
       print(age+1)
   #+END_SRC

** 解析命令行输入
*** sys.argv
    =sys.argv= 其实是一个列表，在可以直接读取，用法如下：

    #+BEGIN_SRC python :exports code
      import sys
      if __name__ == '__main__':
        print(sys.argv)
    #+END_SRC

*** argparse
    =argparse= 是 Python 的标准库，可以用来解析命令行参数，非常好用，详细请参考
    [[https://docs.python.org/3/library/argparse.html][在线文档]]。

    #+BEGIN_SRC python :exports code
      import argparse

      if __name__ == '__main__':
          parser = argparse.ArgumentParser(description="short decription for this
          command.")
          parser.add_argument("-v", "--verbose", action="store_true", help="boolean for verbose")
          parser.add_argument("-a", "--paraA", type=float)
          parser.add_argument("-b", "--paraB", type=float)
          parser.add_argument("folders", nargs='+', help="list of folders")
          args = parser.parse_args()

          yourfunc(args.paraA, args.paraB)
    #+END_SRC

* 列表
** 索引列表元素以及获取子列表
   常见的有直接下标索引，范围索引，倒序索引。

   #+BEGIN_SRC python :exports code
     >>> nums = [1, 2, 3, 4, 5, 6, 7]
     >>> nums[1:3]
     [2, 3]
     >>> nums[-3:]
     [5, 6, 7]
     >>> nums[-2]
     6
     >>>
   #+END_SRC

   使用具有一定步长的索引

   #+BEGIN_SRC python :exports code
     >>> start = 1; end = 7; step  = 2
     >>> nums[start:end:step]
     [2, 4, 6]
     >>>
   #+END_SRC

