lang/python-distilled.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-02 Tue 11:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python 编程语言精粹</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">Python 编程语言精粹</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbcc4202">1. 解释器的环境变量</a>
<ul>
<li><a href="#orgc7c3db9">1.1. PYTHONDONTWRITEBYTECODE 是否写字节码文件</a></li>
<li><a href="#org7d3246b">1.2. PYTHONPATH 系统的搜索路径</a></li>
</ul>
</li>
<li><a href="#org34606d4">2. 读取用户输入</a>
<ul>
<li><a href="#org0359696">2.1. <code>raw_input</code> <code>input</code></a></li>
<li><a href="#org44806c6">2.2. 解析命令行输入</a>
<ul>
<li><a href="#orgddf5c2a">2.2.1. sys.argv</a></li>
<li><a href="#org43e39ea">2.2.2. argparse</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org08d590e">3. 列表</a>
<ul>
<li><a href="#orge0affe3">3.1. 索引列表元素以及获取子列表</a></li>
<li><a href="#org413f0af">3.2. 修改列表内容：添加，扩展，翻转，排序</a></li>
<li><a href="#orgefa1b09">3.3. 统计列表信息: 元素存在性判断，长度，最大最小值</a></li>
<li><a href="#org6b3d373">3.4. 列表查找</a></li>
</ul>
</li>
<li><a href="#org23dc37b">4. 字符串</a>
<ul>
<li><a href="#org46a4d73">4.1. 基本操作，格式化输出，模板字符串</a></li>
<li><a href="#org129322d">4.2. 字符串索引方式</a></li>
<li><a href="#org82e49be">4.3. 字符串查找</a></li>
<li><a href="#org3efd02d">4.4. 修改字符串：替换，删除空格</a></li>
<li><a href="#orgc9ff539">4.5. 字符串和列表转化: split join</a></li>
<li><a href="#org6fe7bb7">4.6. 正则表达式</a></li>
</ul>
</li>
<li><a href="#org7a12f07">5. 字典</a>
<ul>
<li><a href="#org69c1a9d">5.1. 基本操作： 字典的添加、删除、修改</a></li>
<li><a href="#org843d3fc">5.2. 浅拷贝和深拷贝</a></li>
<li><a href="#org6a14fdf">5.3. 构造字典</a></li>
<li><a href="#org276a2eb">5.4. 键是否存在和迭代器</a></li>
<li><a href="#org5c24de1">5.5. 更新字典</a></li>
<li><a href="#org09980c1">5.6. 获取字典的值</a></li>
</ul>
</li>
<li><a href="#org35514a4">6. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgbcc4202" class="outline-2">
<h2 id="orgbcc4202"><span class="section-number-2">1</span> 解释器的环境变量</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc7c3db9" class="outline-3">
<h3 id="orgc7c3db9"><span class="section-number-3">1.1</span> PYTHONDONTWRITEBYTECODE 是否写字节码文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
阻止 Python 解释器生成二进制字节码文件，如 <code>__pycache__</code>, <code>*.pyc</code>, <code>*.pyo</code> 等
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">PYTHONDONTWRITEBYTECODE</span>=1
</pre>
</div>

<p>
附将字节码一次性删除的命令
</p>

<div class="org-src-container">
<pre class="src src-sh">find . -type f -name <span style="color: #2aa198;">"*.py[co]"</span> -delete -or -type d -name <span style="color: #2aa198;">"__pycache__"</span> -delete
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d3246b" class="outline-3">
<h3 id="org7d3246b"><span class="section-number-3">1.2</span> PYTHONPATH 系统的搜索路径</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Python 模块的搜索路径，可以通过 <code>sys.path</code> 变量查看
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900;">import</span> sys
&gt;&gt;&gt; sys.path
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'d:\\Python36\\DLLs'</span>, <span style="color: #2aa198;">'d:\\Python36\\lib'</span>, <span style="color: #2aa198;">'d:\\Python36'</span>, ...<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org34606d4" class="outline-2">
<h2 id="org34606d4"><span class="section-number-2">2</span> 读取用户输入</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0359696" class="outline-3">
<h3 id="org0359696"><span class="section-number-3">2.1</span> <code>raw_input</code> <code>input</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Python3.x 里面已经把 <code>raw_input()</code> 给去掉了。事实上是这样的：在 Python3.x 内，
将 <code>raw_input()</code> 重命名为 <code>input()</code> ，这样一来，无须导入也能从标准输入获得数
据了。如果您需要保留版本 Python2.x 的 <code>input()</code> 功能，可以使用
<code>eval(input())</code> ，效果基本相同。Python2.x 中， <code>raw_input()</code> 会从标准输入
<code>sys.stdin</code> 读取一个输入并返回一个字符串，且尾部的换行符从末尾移除。其中关于
读取用户输入的样例如下：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> os, sys

<span style="color: #859900;">if</span> <span style="color: #6c71c4;">__name__</span> == <span style="color: #2aa198;">'__main__'</span> :
  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">read raw string</span>
  <span style="color: #6c71c4;">name</span> = <span style="color: #6c71c4;">raw_input</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'name = '</span><span style="color: #8d5649;">)</span>
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'your name is '</span> + name<span style="color: #8d5649;">)</span>

  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">read a expression, for example, integer</span>
  <span style="color: #6c71c4;">age</span> = <span style="color: #6c71c4;">input</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'age = '</span><span style="color: #8d5649;">)</span>
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>age+1<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org44806c6" class="outline-3">
<h3 id="org44806c6"><span class="section-number-3">2.2</span> 解析命令行输入</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgddf5c2a" class="outline-4">
<h4 id="orgddf5c2a"><span class="section-number-4">2.2.1</span> sys.argv</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<code>sys.argv</code> 其实是一个列表，在可以直接读取，用法如下：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> sys
<span style="color: #859900;">if</span> <span style="color: #6c71c4;">__name__</span> == <span style="color: #2aa198;">'__main__'</span>:
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sys.argv<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org43e39ea" class="outline-4">
<h4 id="org43e39ea"><span class="section-number-4">2.2.2</span> argparse</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<code>argparse</code> 是 Python 的标准库，可以用来解析命令行参数，非常好用，详细请参考
<a href="https://docs.python.org/3/library/argparse.html">在线文档</a>。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> argparse

<span style="color: #859900;">if</span> <span style="color: #6c71c4;">__name__</span> == <span style="color: #2aa198;">'__main__'</span>:
    <span style="color: #6c71c4;">parser</span> = argparse.ArgumentParser<span style="color: #8d5649;">(</span>description=<span style="color: #2aa198;">"short decription for this</span>
<span style="color: #2aa198;">    command."</span><span style="color: #8d5649;">)</span>
    parser.add_argument<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"-v"</span>, <span style="color: #2aa198;">"--verbose"</span>, action=<span style="color: #2aa198;">"store_true"</span>, <span style="color: #6c71c4;">help</span>=<span style="color: #2aa198;">"boolean for verbose"</span><span style="color: #8d5649;">)</span>
    parser.add_argument<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"-a"</span>, <span style="color: #2aa198;">"--paraA"</span>, <span style="color: #6c71c4;">type</span>=<span style="color: #6c71c4;">float</span><span style="color: #8d5649;">)</span>
    parser.add_argument<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"-b"</span>, <span style="color: #2aa198;">"--paraB"</span>, <span style="color: #6c71c4;">type</span>=<span style="color: #6c71c4;">float</span><span style="color: #8d5649;">)</span>
    parser.add_argument<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"folders"</span>, nargs=<span style="color: #2aa198;">'+'</span>, <span style="color: #6c71c4;">help</span>=<span style="color: #2aa198;">"list of folders"</span><span style="color: #8d5649;">)</span>
    <span style="color: #6c71c4;">args</span> = parser.parse_args<span style="color: #8d5649;">()</span>

    yourfunc<span style="color: #8d5649;">(</span>args.paraA, args.paraB<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org08d590e" class="outline-2">
<h2 id="org08d590e"><span class="section-number-2">3</span> 列表</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge0affe3" class="outline-3">
<h3 id="orge0affe3"><span class="section-number-3">3.1</span> 索引列表元素以及获取子列表</h3>
<div class="outline-text-3" id="text-3-1">
<p>
常见的有直接下标索引，范围索引，倒序索引。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">nums</span> = <span style="color: #8d5649;">[</span>1, 2, 3, 4, 5, 6, 7<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; nums<span style="color: #8d5649;">[</span>1:3<span style="color: #8d5649;">]</span>
<span style="color: #8d5649;">[</span>2, 3<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; nums<span style="color: #8d5649;">[</span>-3:<span style="color: #8d5649;">]</span>
<span style="color: #8d5649;">[</span>5, 6, 7<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; nums<span style="color: #8d5649;">[</span>-2<span style="color: #8d5649;">]</span>
6
&gt;&gt;&gt;
</pre>
</div>

<p>
使用具有一定步长的索引
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">start</span> = 1; <span style="color: #6c71c4;">end</span> = 7; <span style="color: #6c71c4;">step</span>  = 2
&gt;&gt;&gt; nums<span style="color: #8d5649;">[</span>start:end:step<span style="color: #8d5649;">]</span>
<span style="color: #8d5649;">[</span>2, 4, 6<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
