lang/python-distilled.org
** 修改列表内容：添加，扩展，翻转，排序
   =append= 方法向列表最后添加元素，注意这样添加的方式是 *引用* ， 如果需要复制
   的方式则需要 *深度复制* 。

   #+BEGIN_SRC python :exports code
     >>> x = [1, 2, 3]
     >>> y = x
     >>> x.append(4)
     >>> x
     [1, 2, 3, 4]
     >>> y
     [1, 2, 3, 4]
     >>>
     >>> from copy import copy
     >>> y = copy(x)
     >>> x.append(5)
     >>> x
     [1, 2, 3, 4, 5]
     >>> y
     [1, 2, 3, 4]
     >>>
   #+END_SRC

   =insert= 插入元素， =pop= 出栈元素， =remove=查找并删除特定元素， =clear= 清
   除所有列表。

   #+BEGIN_SRC python :exports code
     >>> friuts = ['apple', 'banana', 'orange']
     >>> friuts.insert(1, 'pear')
     >>> friuts
     ['apple', 'pear', 'banana', 'orange']
     >>> friuts.pop()
     'orange'
     >>> friuts
     ['apple', 'pear', 'banana']
     >>> friuts.remove('apple')
     >>> friuts
     ['pear', 'banana']
     >>> friuts.clear()
     >>> friuts
     []
     >>>
   #+END_SRC

   =extend= 使用一个列表来扩展列表，相当于合并两个列表

   #+BEGIN_SRC python :exports code
     >>> x = [1, 2, 3]; y = [5, 7]
     >>> x.extend(y)
     >>> x
     [1, 2, 3, 5, 7]
     >>>
   #+END_SRC

   =reverse= 翻转列表。 =sort= 成员方法在修改当前列表的元素，对其进行排序。
   =sorted= 返回排序后的副本。
   #+BEGIN_SRC python :exports code
     >>> x = [4, 6, 2, 1, 0, 6]
     >>> x.reverse()
     >>> x
     [6, 0, 1, 2, 6, 4]
     >>> y = sorted(x)
     >>> x
     [6, 0, 1, 2, 6, 4]
     >>> y
     [0, 1, 2, 4, 6, 6]
     >>> x.sort()
     >>> x
     [0, 1, 2, 4, 6, 6]
     >>> friuts = ['apple', 'pear', 'banana', 'orange']
     >>> friuts.sort(key=len) # 按单词长度排序
     >>> friuts
     ['pear', 'apple', 'banana', 'orange']
     >>> friuts.sort() # 按字典序排序
     >>> friuts
     ['apple', 'banana', 'orange', 'pear']
     >>>
   #+END_SRC

   一个非常重要的技巧， *通过赋值的方式来增加和删除列表中的元素* 。

   #+BEGIN_SRC python :exports code
     >>> numbers = [1, 5]
     >>> numbers[1:1] = [2, 3, 4] # add elements by assign
     >>> numbers
     [1, 2, 3, 4, 5]
     >>> numbers[-3:] = [] # delete elements by assign empty list
     >>> numbers
     [1, 2]
     >>>
   #+END_SRC

** 统计列表信息: 元素存在性判断，长度，最大最小值
   使用 =in= 可以判断当前元素是否在一个列表里。 =len= 是求列表的长度， =min= 求列表
   中的最小值。

   #+BEGIN_SRC python :exports code
     >>> greeting = 'Hello'
     >>> 'x' in greeting
     False
     >>> 'l' in greeting
     True
     >>> len(greeting)
     5
     >>> min(greeting)
     'H'
     >>>
   #+END_SRC

** 列表查找
   =count= 对列表中的元素计数

   #+BEGIN_SRC python :exports code
     >>> numbers = [1, 2, 1, 3, 4, 2, 1]
     >>> numbers.count(1)
     3
     >>>
   #+END_SRC

   =index= 查找元素，返回元素下标。如果元素不存在则抛出 ValueError 异常

   #+BEGIN_SRC python :exports code
     >>> friuts = ['apple', 'banana', 'orange']
     >>> friuts.index("apple")
     0
     >>> friuts.index("foo")
     Traceback (most recent call last):
       File "<stdin>", line 1, in <module>
     ValueError: 'foo' is not in list
     >>>
   #+END_SRC

* 字符串
