lang/python-distilled.html

<div id="outline-container-org413f0af" class="outline-3">
<h3 id="org413f0af"><span class="section-number-3">3.2</span> 修改列表内容：添加，扩展，翻转，排序</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>append</code> 方法向列表最后添加元素，注意这样添加的方式是 <b>引用</b> ， 如果需要复制
的方式则需要 <b>深度复制</b> 。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">[</span>1, 2, 3<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = x
&gt;&gt;&gt; x.append<span style="color: #8d5649;">(</span>4<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>1, 2, 3, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">[</span>1, 2, 3, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
&gt;&gt;&gt; <span style="color: #859900;">from</span> copy <span style="color: #859900;">import</span> copy
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = copy<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x.append<span style="color: #8d5649;">(</span>5<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>1, 2, 3, 4, 5<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">[</span>1, 2, 3, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>insert</code> 插入元素， <code>pop</code> 出栈元素， <code>remove=查找并删除特定元素， =clear</code> 清
除所有列表。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">friuts</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.insert<span style="color: #8d5649;">(</span>1, <span style="color: #2aa198;">'pear'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'pear'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.pop<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'orange'</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'pear'</span>, <span style="color: #2aa198;">'banana'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.remove<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'apple'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'pear'</span>, <span style="color: #2aa198;">'banana'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.clear<span style="color: #8d5649;">()</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[]</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>extend</code> 使用一个列表来扩展列表，相当于合并两个列表
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">[</span>1, 2, 3<span style="color: #8d5649;">]</span>; <span style="color: #6c71c4;">y</span> = <span style="color: #8d5649;">[</span>5, 7<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; x.extend<span style="color: #8d5649;">(</span>y<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>1, 2, 3, 5, 7<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>reverse</code> 翻转列表。 <code>sort</code> 成员方法在修改当前列表的元素，对其进行排序。
<code>sorted</code> 返回排序后的副本。
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">[</span>4, 6, 2, 1, 0, 6<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; x.reverse<span style="color: #8d5649;">()</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>6, 0, 1, 2, 6, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = <span style="color: #6c71c4;">sorted</span><span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>6, 0, 1, 2, 6, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">[</span>0, 1, 2, 4, 6, 6<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; x.sort<span style="color: #8d5649;">()</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">[</span>0, 1, 2, 4, 6, 6<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">friuts</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'pear'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.sort<span style="color: #8d5649;">(</span>key=<span style="color: #6c71c4;">len</span><span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#21333;&#35789;&#38271;&#24230;&#25490;&#24207;</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'pear'</span>, <span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.sort<span style="color: #8d5649;">()</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#25353;&#23383;&#20856;&#24207;&#25490;&#24207;</span>
&gt;&gt;&gt; friuts
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span>, <span style="color: #2aa198;">'pear'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
一个非常重要的技巧， <b>通过赋值的方式来增加和删除列表中的元素</b> 。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">numbers</span> = <span style="color: #8d5649;">[</span>1, 5<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">numbers</span><span style="color: #8d5649;">[</span>1:1<span style="color: #8d5649;">]</span> = <span style="color: #8d5649;">[</span>2, 3, 4<span style="color: #8d5649;">]</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">add elements by assign</span>
&gt;&gt;&gt; numbers
<span style="color: #8d5649;">[</span>1, 2, 3, 4, 5<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">numbers</span><span style="color: #8d5649;">[</span>-3:<span style="color: #8d5649;">]</span> = <span style="color: #8d5649;">[]</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">delete elements by assign empty list</span>
&gt;&gt;&gt; numbers
<span style="color: #8d5649;">[</span>1, 2<span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefa1b09" class="outline-3">
<h3 id="orgefa1b09"><span class="section-number-3">3.3</span> 统计列表信息: 元素存在性判断，长度，最大最小值</h3>
<div class="outline-text-3" id="text-3-3">
<p>
使用 <code>in</code> 可以判断当前元素是否在一个列表里。 <code>len</code> 是求列表的长度， <code>min</code> 求列表
中的最小值。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">greeting</span> = <span style="color: #2aa198;">'Hello'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'x'</span> <span style="color: #859900;">in</span> greeting
<span style="color: #268bd2;">False</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'l'</span> <span style="color: #859900;">in</span> greeting
<span style="color: #268bd2;">True</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">len</span><span style="color: #8d5649;">(</span>greeting<span style="color: #8d5649;">)</span>
5
&gt;&gt;&gt; <span style="color: #6c71c4;">min</span><span style="color: #8d5649;">(</span>greeting<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'H'</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b3d373" class="outline-3">
<h3 id="org6b3d373"><span class="section-number-3">3.4</span> 列表查找</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>count</code> 对列表中的元素计数
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">numbers</span> = <span style="color: #8d5649;">[</span>1, 2, 1, 3, 4, 2, 1<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; numbers.count<span style="color: #8d5649;">(</span>1<span style="color: #8d5649;">)</span>
3
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>index</code> 查找元素，返回元素下标。如果元素不存在则抛出 ValueError 异常
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">friuts</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; friuts.index<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"apple"</span><span style="color: #8d5649;">)</span>
0
&gt;&gt;&gt; friuts.index<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"foo"</span><span style="color: #8d5649;">)</span>
Traceback <span style="color: #8d5649;">(</span>most recent call last<span style="color: #8d5649;">)</span>:
  File <span style="color: #2aa198;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #859900;">in</span> &lt;module&gt;
<span style="color: #268bd2;">ValueError</span>: <span style="color: #2aa198;">'foo'</span> <span style="color: #859900;">is</span> <span style="color: #859900;">not</span> <span style="color: #859900;">in</span> <span style="color: #6c71c4;">list</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
