lang/python-distilled.org
** 基本操作，格式化输出，模板字符串

   字符串有类似于列表的索引操作，也可以使用 =%= 和元组的组合方式来输出格式化字符
   串。

   #+BEGIN_SRC python :exports code
     >>> url = 'http://jeanhwea.github.io'
     >>> url[-2:]
     'io'
     >>> fmt = 'first: %s, second: %s'
     >>> val = ('hello', 'Jeanhwea')
     >>> fmt % val
     'first: hello, second: Jeanhwea'
     >>>
   #+END_SRC

   Python 支持字符串模板的操作，但是并没有 Ruby 那么好用，一般的操作方式如下：

   #+BEGIN_SRC python :exports code
     >>> from string import Template
     >>> s = Template('$friut is $color') # using $$ to diplay $
     >>> data = {'friut': 'apple', 'color': 'red'}
     >>> s.substitute(friut='banana', color='yellow')
     'banana is yellow'
     >>> s.substitute(data)
     'apple is red'
     >>>
   #+END_SRC


   另外一直比较常用的模板字符串形式如下，操作清晰易懂，建议使用这种方式来操作字符串。

   #+BEGIN_SRC python :exports code
     >>> foo = 'foo'
     >>> bar = 'bar'
     >>> '%s%s' % (foo, bar)
     'foobar'
     >>> '{0}{1}'.format(foo, bar)
     'foobar'
     >>> '{foo}{bar}'.format(foo=foo, bar=bar)
     'foobar'
     >>> '{{foo}}{bar}'.format(foo=foo, bar=bar)
     '{foo}bar'
     >>>
   #+END_SRC

** 字符串索引方式

  #+BEGIN_SRC python :exports code
    #  +---+---+---+---+---+---+
    #  | P | y | t | h | o | n |
    #  +---+---+---+---+---+---+
    #  0   1   2   3   4   5   6
    # -6  -5  -4  -3  -2  -1
    >>> python = 'Python'
    >>> python[0]
    'P'
    >>> python[-1]
    'n'
    >>> python[-3]
    'h'
    >>>
   #+END_SRC

** 字符串查找
   =find= 查找字符串的内容, 类似的有 =lfind= 和 =rfind= 。 =startswith= 和
   =endswith= 判定开头和结尾字母。

   #+BEGIN_SRC python :exports code
     >>> url = 'http://jeanhwea.github.io'
     >>> url.find('jeanhwea')
     7
     >>> url.find('nothing')
     -1
     >>> start = 10
     >>> url.find('e', start)
     13
     >>> 'hello, man'.startswith('hi')
     False
     >>> 'hello, man'.startswith('hello')
     True
     >>> 'hello, man'.endswith('man')
     True
     >>>
   #+END_SRC

** 修改字符串：替换，删除空格
   =replace= 替换字符串

   #+BEGIN_SRC python :exports code
     str = "Hello, world"
     >>> str.replace("world", "Jinghui")
     'Hello, Jinghui'
     >>> "aaba".replace("a", "$")
     '$$b$'
     >>> "aaba".replace("a", "$", 1)
     '$aba'
     >>>
   #+END_SRC

   =strip= 可以移除字符串前后的空白字符，另外有 =lstrip= 和 =rstrip= 。其它一些
   转化大小写的函数见代码演示。

   #+BEGIN_SRC python :exports code
     >>> foo = '   internal whitespace is kept    '
     >>> foo.strip()
     'internal whitespace is kept'
     >>> foo.lstrip()
     'internal whitespace is kept    '
     >>> foo.rstrip()
     '   internal whitespace is kept'
     >>> foo.upper()
     '   INTERNAL WHITESPACE IS KEPT    '
     >>> foo.lower()
     '   internal whitespace is kept    '
     >>> foo.strip().capitalize()
     'Internal whitespace is kept'
     >>> from string import capwords
     >>> capwords(foo)
     'Internal Whitespace Is Kept'
     >>>
   #+END_SRC

** 字符串和列表转化: split join
   =join= 连接字符串， =split= 分割字符串
   #+BEGIN_SRC python :exports code
     >>> dirs = 'home' , 'hujh', 'Projects' # tuple
     >>> dirs
     ('home', 'hujh', 'Projects')
     >>> '/'.join(dirs)
     'home/hujh/Projects'
     >>> seq = [1, 2, 4]
     >>> '+'.join([str(n) for n in seq])
     '1+2+4'
     >>> '1+2+3+4'.split('+')
     ['1', '2', '3', '4']
     >>>
   #+END_SRC

