lang/python-distilled.html

<div id="outline-container-org23dc37b" class="outline-2">
<h2 id="org23dc37b"><span class="section-number-2">4</span> 字符串</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org46a4d73" class="outline-3">
<h3 id="org46a4d73"><span class="section-number-3">4.1</span> 基本操作，格式化输出，模板字符串</h3>
<div class="outline-text-3" id="text-4-1">
<p>
字符串有类似于列表的索引操作，也可以使用 <code>%</code> 和元组的组合方式来输出格式化字符
串。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">url</span> = <span style="color: #2aa198;">'http://jeanhwea.github.io'</span>
&gt;&gt;&gt; url<span style="color: #8d5649;">[</span>-2:<span style="color: #8d5649;">]</span>
<span style="color: #2aa198;">'io'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">fmt</span> = <span style="color: #2aa198;">'first: %s, second: %s'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">val</span> = <span style="color: #8d5649;">(</span><span style="color: #2aa198;">'hello'</span>, <span style="color: #2aa198;">'Jeanhwea'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; fmt % val
<span style="color: #2aa198;">'first: hello, second: Jeanhwea'</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
Python 支持字符串模板的操作，但是并没有 Ruby 那么好用，一般的操作方式如下：
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900;">from</span> string <span style="color: #859900;">import</span> Template
&gt;&gt;&gt; <span style="color: #6c71c4;">s</span> = Template<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'$friut is $color'</span><span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">using $$ to diplay $</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">data</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'friut'</span>: <span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'color'</span>: <span style="color: #2aa198;">'red'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; s.substitute<span style="color: #8d5649;">(</span>friut=<span style="color: #2aa198;">'banana'</span>, color=<span style="color: #2aa198;">'yellow'</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'banana is yellow'</span>
&gt;&gt;&gt; s.substitute<span style="color: #8d5649;">(</span>data<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'apple is red'</span>
&gt;&gt;&gt;
</pre>
</div>


<p>
另外一直比较常用的模板字符串形式如下，操作清晰易懂，建议使用这种方式来操作字符串。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'foo'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">bar</span> = <span style="color: #2aa198;">'bar'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'%s%s'</span> % <span style="color: #8d5649;">(</span>foo, bar<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'foobar'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'{0}{1}'</span>.<span style="color: #6c71c4;">format</span><span style="color: #8d5649;">(</span>foo, bar<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'foobar'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'{foo}{bar}'</span>.<span style="color: #6c71c4;">format</span><span style="color: #8d5649;">(</span>foo=foo, bar=bar<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'foobar'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'{{foo}}{bar}'</span>.<span style="color: #6c71c4;">format</span><span style="color: #8d5649;">(</span>foo=foo, bar=bar<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'{foo}bar'</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org129322d" class="outline-3">
<h3 id="org129322d"><span class="section-number-3">4.2</span> 字符串索引方式</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">+---+---+---+---+---+---+</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">| P | y | t | h | o | n |</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">+---+---+---+---+---+---+</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">0   1   2   3   4   5   6</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">-6  -5  -4  -3  -2  -1</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">python</span> = <span style="color: #2aa198;">'Python'</span>
&gt;&gt;&gt; python<span style="color: #8d5649;">[</span>0<span style="color: #8d5649;">]</span>
<span style="color: #2aa198;">'P'</span>
&gt;&gt;&gt; python<span style="color: #8d5649;">[</span>-1<span style="color: #8d5649;">]</span>
<span style="color: #2aa198;">'n'</span>
&gt;&gt;&gt; python<span style="color: #8d5649;">[</span>-3<span style="color: #8d5649;">]</span>
<span style="color: #2aa198;">'h'</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org82e49be" class="outline-3">
<h3 id="org82e49be"><span class="section-number-3">4.3</span> 字符串查找</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<code>find</code> 查找字符串的内容, 类似的有 <code>lfind</code> 和 <code>rfind</code> 。 <code>startswith</code> 和
<code>endswith</code> 判定开头和结尾字母。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">url</span> = <span style="color: #2aa198;">'http://jeanhwea.github.io'</span>
&gt;&gt;&gt; url.find<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'jeanhwea'</span><span style="color: #8d5649;">)</span>
7
&gt;&gt;&gt; url.find<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'nothing'</span><span style="color: #8d5649;">)</span>
-1
&gt;&gt;&gt; <span style="color: #6c71c4;">start</span> = 10
&gt;&gt;&gt; url.find<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'e'</span>, start<span style="color: #8d5649;">)</span>
13
&gt;&gt;&gt; <span style="color: #2aa198;">'hello, man'</span>.startswith<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'hi'</span><span style="color: #8d5649;">)</span>
<span style="color: #268bd2;">False</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'hello, man'</span>.startswith<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'hello'</span><span style="color: #8d5649;">)</span>
<span style="color: #268bd2;">True</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'hello, man'</span>.endswith<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'man'</span><span style="color: #8d5649;">)</span>
<span style="color: #268bd2;">True</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3efd02d" class="outline-3">
<h3 id="org3efd02d"><span class="section-number-3">4.4</span> 修改字符串：替换，删除空格</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<code>replace</code> 替换字符串
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">str</span> = <span style="color: #2aa198;">"Hello, world"</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">str</span>.replace<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"world"</span>, <span style="color: #2aa198;">"Jinghui"</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'Hello, Jinghui'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">"aaba"</span>.replace<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"a"</span>, <span style="color: #2aa198;">"$"</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'$$b$'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">"aaba"</span>.replace<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"a"</span>, <span style="color: #2aa198;">"$"</span>, 1<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'$aba'</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>strip</code> 可以移除字符串前后的空白字符，另外有 <code>lstrip</code> 和 <code>rstrip</code> 。其它一些
转化大小写的函数见代码演示。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'   internal whitespace is kept    '</span>
&gt;&gt;&gt; foo.strip<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'internal whitespace is kept'</span>
&gt;&gt;&gt; foo.lstrip<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'internal whitespace is kept    '</span>
&gt;&gt;&gt; foo.rstrip<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'   internal whitespace is kept'</span>
&gt;&gt;&gt; foo.upper<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'   INTERNAL WHITESPACE IS KEPT    '</span>
&gt;&gt;&gt; foo.lower<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'   internal whitespace is kept    '</span>
&gt;&gt;&gt; foo.strip<span style="color: #8d5649;">()</span>.capitalize<span style="color: #8d5649;">()</span>
<span style="color: #2aa198;">'Internal whitespace is kept'</span>
&gt;&gt;&gt; <span style="color: #859900;">from</span> string <span style="color: #859900;">import</span> capwords
&gt;&gt;&gt; capwords<span style="color: #8d5649;">(</span>foo<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'Internal Whitespace Is Kept'</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9ff539" class="outline-3">
<h3 id="orgc9ff539"><span class="section-number-3">4.5</span> 字符串和列表转化: split join</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<code>join</code> 连接字符串， <code>split</code> 分割字符串
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">dirs</span> = <span style="color: #2aa198;">'home'</span> , <span style="color: #2aa198;">'hujh'</span>, <span style="color: #2aa198;">'Projects'</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">tuple</span>
&gt;&gt;&gt; dirs
<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'home'</span>, <span style="color: #2aa198;">'hujh'</span>, <span style="color: #2aa198;">'Projects'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'/'</span>.join<span style="color: #8d5649;">(</span>dirs<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'home/hujh/Projects'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">seq</span> = <span style="color: #8d5649;">[</span>1, 2, 4<span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'+'</span>.join<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #6c71c4;">str</span><span style="color: #9564bf;">(</span>n<span style="color: #9564bf;">)</span> <span style="color: #859900;">for</span> n <span style="color: #859900;">in</span> seq<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'1+2+4'</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'1+2+3+4'</span>.split<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'+'</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'1'</span>, <span style="color: #2aa198;">'2'</span>, <span style="color: #2aa198;">'3'</span>, <span style="color: #2aa198;">'4'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
