lang/python-distilled.org
** 正则表达式
   正则表达式是处理文档的必备工具，常用的有 =search= ， =match= ， =findall= ，
   =finditer= 这几个函数。

   =search= 若 string 中包含 pattern 子串，则返回 Match 对象，否则返回 None，注意，如果
   string 中存在多个 pattern 子串，只返回第一个。

   =match= 从首字母开始开始匹配，string 如果包含 pattern 子串，则匹配成功，返回
   Match 对象，失败则返回 None，若要完全匹配，pattern 要以$结尾。

   =findall= 返回 string 中所有与 pattern 相匹配的全部字串，返回形式为数组。

   #+BEGIN_SRC python :exports code
     >>> import re
     >>> re.search(r'(abc)', 'hello abc.')
     <_sre.SRE_Match object; span=(6, 9), match='abc'>
     >>> m = re.search(r'(abc)', 'hello abc.')
     >>> m.group(0)
     'abc'
     >>> m = re.match(r'(abc)', 'hello abc.')
     >>> m.group(0)
     Traceback (most recent call last):
       File "<stdin>", line 1, in <module>
     AttributeError: 'NoneType' object has no attribute 'group'
     >>> m = re.match(r'(\w+)', 'hello abc.')
     >>> m.group(0)
     'hello'
     >>> re.findall(r'\w+', 'hello abc.')
     ['hello', 'abc']
     >>>
   #+END_SRC
* 字典
** 基本操作： 字典的添加、删除、修改
   #+BEGIN_SRC python :exports code
     >>> items = [('name', 'Jeanhwea'), ('age', '24')]
     >>> d = dict(items)
     >>> d['name']
     'Jeanhwea'
     >>> d['gender'] = 'male'
     >>> d
     {'name': 'Jeanhwea', 'age': '24', 'gender': 'male'}
     >>> len(d)
     3
     >>> del d['age']
     >>> d
     {'name': 'Jeanhwea', 'gender': 'male'}
     >>> 'name' in d
     True
     >>> d
     {'name': 'Jeanhwea', 'gender': 'male'}
     >>> d.clear()
     >>> d
     {}
     >>>
   #+END_SRC

   关于字典引用的相关操作， *如何优雅地置空原字典而不影响引用的列表*

   #+BEGIN_SRC python :exports code
     >>> x = {}
     >>> x['key1'] = 'val1'
     >>> x
     {'key1': 'val1'}
     >>> y = x
     >>> y
     {'key1': 'val1'}
     >>> x.clear() # clear x as well as y
     >>> y
     {}

     >>> x['key2'] = 'val2'
     >>> x
     {'key2': 'val2'}
     >>> y
     {'key2': 'val2'}
     >>> x = {} # bind x to {}, while y stay it old state
     >>> y
     {'key2': 'val2'}
     >>>
   #+END_SRC

