lang/python-distilled.html

<div id="outline-container-org6fe7bb7" class="outline-3">
<h3 id="org6fe7bb7"><span class="section-number-3">4.6</span> 正则表达式</h3>
<div class="outline-text-3" id="text-4-6">
<p>
正则表达式是处理文档的必备工具，常用的有 <code>search</code> ， <code>match</code> ， <code>findall</code> ，
<code>finditer</code> 这几个函数。
</p>

<p>
<code>search</code> 若 string 中包含 pattern 子串，则返回 Match 对象，否则返回 None，注意，如果
string 中存在多个 pattern 子串，只返回第一个。
</p>

<p>
<code>match</code> 从首字母开始开始匹配，string 如果包含 pattern 子串，则匹配成功，返回
Match 对象，失败则返回 None，若要完全匹配，pattern 要以$结尾。
</p>

<p>
<code>findall</code> 返回 string 中所有与 pattern 相匹配的全部字串，返回形式为数组。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900;">import</span> re
&gt;&gt;&gt; re.search<span style="color: #8d5649;">(</span>r<span style="color: #2aa198;">'(abc)'</span>, <span style="color: #2aa198;">'hello abc.'</span><span style="color: #8d5649;">)</span>
&lt;_sre.SRE_Match <span style="color: #6c71c4;">object</span>; <span style="color: #6c71c4;">span</span>=<span style="color: #8d5649;">(</span>6, 9<span style="color: #8d5649;">)</span>, <span style="color: #6c71c4;">match</span>=<span style="color: #2aa198;">'abc'</span>&gt;
&gt;&gt;&gt; <span style="color: #6c71c4;">m</span> = re.search<span style="color: #8d5649;">(</span>r<span style="color: #2aa198;">'(abc)'</span>, <span style="color: #2aa198;">'hello abc.'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; m.group<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'abc'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">m</span> = re.match<span style="color: #8d5649;">(</span>r<span style="color: #2aa198;">'(abc)'</span>, <span style="color: #2aa198;">'hello abc.'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; m.group<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>
Traceback <span style="color: #8d5649;">(</span>most recent call last<span style="color: #8d5649;">)</span>:
  File <span style="color: #2aa198;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #859900;">in</span> &lt;module&gt;
<span style="color: #268bd2;">AttributeError</span>: <span style="color: #2aa198;">'NoneType'</span> <span style="color: #6c71c4;">object</span> has no attribute <span style="color: #2aa198;">'group'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">m</span> = re.match<span style="color: #8d5649;">(</span>r<span style="color: #2aa198;">'(\w+)'</span>, <span style="color: #2aa198;">'hello abc.'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; m.group<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'hello'</span>
&gt;&gt;&gt; re.findall<span style="color: #8d5649;">(</span>r<span style="color: #2aa198;">'\w+'</span>, <span style="color: #2aa198;">'hello abc.'</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'hello'</span>, <span style="color: #2aa198;">'abc'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7a12f07" class="outline-2">
<h2 id="org7a12f07"><span class="section-number-2">5</span> 字典</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org69c1a9d" class="outline-3">
<h3 id="org69c1a9d"><span class="section-number-3">5.1</span> 基本操作： 字典的添加、删除、修改</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">items</span> = <span style="color: #8d5649;">[</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'Jeanhwea'</span><span style="color: #d8241f;">)</span>, <span style="color: #d8241f;">(</span><span style="color: #2aa198;">'age'</span>, <span style="color: #2aa198;">'24'</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">d</span> = <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>items<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; d<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #8d5649;">]</span>
<span style="color: #2aa198;">'Jeanhwea'</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">d</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'gender'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'male'</span>
&gt;&gt;&gt; d
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'age'</span>: <span style="color: #2aa198;">'24'</span>, <span style="color: #2aa198;">'gender'</span>: <span style="color: #2aa198;">'male'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">len</span><span style="color: #8d5649;">(</span>d<span style="color: #8d5649;">)</span>
3
&gt;&gt;&gt; <span style="color: #859900;">del</span> d<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'age'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; d
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'gender'</span>: <span style="color: #2aa198;">'male'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #2aa198;">'name'</span> <span style="color: #859900;">in</span> d
<span style="color: #268bd2;">True</span>
&gt;&gt;&gt; d
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'gender'</span>: <span style="color: #2aa198;">'male'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; d.clear<span style="color: #8d5649;">()</span>
&gt;&gt;&gt; d
<span style="color: #8d5649;">{}</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
关于字典引用的相关操作， <b>如何优雅地置空原字典而不影响引用的列表</b>
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'key1'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'val1'</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'key1'</span>: <span style="color: #2aa198;">'val1'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = x
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'key1'</span>: <span style="color: #2aa198;">'val1'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; x.clear<span style="color: #8d5649;">()</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">clear x as well as y</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{}</span>

&gt;&gt;&gt; <span style="color: #6c71c4;">x</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'key2'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'val2'</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'key2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'key2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{}</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">bind x to {}, while y stay it old state</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'key2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
