lang/python-distilled.org
** 浅拷贝和深拷贝

   字典也有浅拷贝和深拷贝的区别，具体见下面代码。

   #+BEGIN_SRC python :exports code
     >>> # 浅拷贝
     >>> x = { 'name': 'Jeanhwea', 'friends': ['Jack', 'Alice'] }
     >>> y = x.copy()
     >>> y['name'] = 'Wang'
     >>> x
     {'name': 'Jeanhwea', 'friends': ['Jack', 'Alice']}
     >>> y
     {'name': 'Wang', 'friends': ['Jack', 'Alice']}
     >>> y['friends'].remove('Jack')
     >>> x
     {'name': 'Jeanhwea', 'friends': ['Alice']}
     >>> y
     {'name': 'Wang', 'friends': ['Alice']}
     >>>
     >>> # 深拷贝
     >>> x = { 'name': 'Jeanhwea', 'friends': ['Jack', 'Alice'] }
     >>> from copy import deepcopy
     >>> y = deepcopy(x)
     >>> y['name'] = 'Wang'
     >>> x
     {'name': 'Jeanhwea', 'friends': ['Jack', 'Alice']}
     >>> y
     {'name': 'Wang', 'friends': ['Jack', 'Alice']}
     >>> y['friends'].remove('Jack')
     >>> x
     {'name': 'Jeanhwea', 'friends': ['Jack', 'Alice']}
     >>> y
     {'name': 'Wang', 'friends': ['Alice']}
     >>>
   #+END_SRC

** 构造字典
   =fromkeys= 通过列表生成字典。查字典时， =get= 方法不会引起异常，直接索引会引起异
   常。

   #+BEGIN_SRC python :exports code
     >>> keys = ['a', 'b', 'c']
     >>> {}.fromkeys(keys)
     {'a': None, 'b': None, 'c': None}
     >>> {}.fromkeys(keys, '(none)')
     {'a': '(none)', 'b': '(none)', 'c': '(none)'}
     >>> x = {'k1': 'val1', 'k2': 'val2'}
     >>> x['c']
     Traceback (most recent call last):
       File "<stdin>", line 1, in <module>
     KeyError: 'c'
     >>> x.get('c')
     >>> x.get('c') == None
     True
     >>>
   #+END_SRC

   下面的创建字典的方法结果是一样的
   #+BEGIN_SRC python :exports code
     >>> dict(one=1, two=2, three=3)
     {'one': 1, 'two': 2, 'three': 3}
     >>> {'one': 1, 'two': 2, 'three': 3}
     {'one': 1, 'two': 2, 'three': 3}
     >>> dict(zip(['one', 'two', 'three'], [1, 2, 3]))
     {'one': 1, 'two': 2, 'three': 3}
     >>> dict([('two', 2), ('one', 1), ('three', 3)])
     {'two': 2, 'one': 1, 'three': 3}
     >>> dict({'three': 3, 'one': 1, 'two': 2})
     {'three': 3, 'one': 1, 'two': 2}
     >>>
   #+END_SRC

