lang/python-distilled.html

<div id="outline-container-org843d3fc" class="outline-3">
<h3 id="org843d3fc"><span class="section-number-3">5.2</span> 浅拷贝和深拷贝</h3>
<div class="outline-text-3" id="text-5-2">
<p>
字典也有浅拷贝和深拷贝的区别，具体见下面代码。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#27973;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span> <span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = x.copy<span style="color: #8d5649;">()</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'Wang'</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Wang'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'friends'</span><span style="color: #8d5649;">]</span>.remove<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'Jack'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Wang'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt;
&gt;&gt;&gt; <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#28145;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span> <span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #859900;">from</span> copy <span style="color: #859900;">import</span> deepcopy
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = deepcopy<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'Wang'</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Wang'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'friends'</span><span style="color: #8d5649;">]</span>.remove<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'Jack'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; y
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Wang'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a14fdf" class="outline-3">
<h3 id="org6a14fdf"><span class="section-number-3">5.3</span> 构造字典</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<code>fromkeys</code> 通过列表生成字典。查字典时， <code>get</code> 方法不会引起异常，直接索引会引起异
常。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">keys</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">]</span>
&gt;&gt;&gt; <span style="color: #8d5649;">{}</span>.fromkeys<span style="color: #8d5649;">(</span>keys<span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #268bd2;">None</span>, <span style="color: #2aa198;">'b'</span>: <span style="color: #268bd2;">None</span>, <span style="color: #2aa198;">'c'</span>: <span style="color: #268bd2;">None</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #8d5649;">{}</span>.fromkeys<span style="color: #8d5649;">(</span>keys, <span style="color: #2aa198;">'(none)'</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #2aa198;">'(none)'</span>, <span style="color: #2aa198;">'b'</span>: <span style="color: #2aa198;">'(none)'</span>, <span style="color: #2aa198;">'c'</span>: <span style="color: #2aa198;">'(none)'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'k1'</span>: <span style="color: #2aa198;">'val1'</span>, <span style="color: #2aa198;">'k2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; x<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">]</span>
Traceback <span style="color: #8d5649;">(</span>most recent call last<span style="color: #8d5649;">)</span>:
  File <span style="color: #2aa198;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #859900;">in</span> &lt;module&gt;
<span style="color: #268bd2;">KeyError</span>: <span style="color: #2aa198;">'c'</span>
&gt;&gt;&gt; x.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">)</span> == <span style="color: #268bd2;">None</span>
<span style="color: #268bd2;">True</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
下面的创建字典的方法结果是一样的
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>one=1, two=2, three=3<span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #d33682;">'one'</span>: 1, <span style="color: #d33682;">'two'</span>: 2, <span style="color: #d33682;">'three'</span>: 3<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'two'</span>: 2, <span style="color: #2aa198;">'three'</span>: 3<span style="color: #8d5649;">}</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'two'</span>: 2, <span style="color: #2aa198;">'three'</span>: 3<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">zip</span><span style="color: #d8241f;">(</span><span style="color: #9564bf;">[</span><span style="color: #2aa198;">'one'</span>, <span style="color: #2aa198;">'two'</span>, <span style="color: #2aa198;">'three'</span><span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>1, 2, 3<span style="color: #9564bf;">]</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'two'</span>: 2, <span style="color: #2aa198;">'three'</span>: 3<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">(</span><span style="color: #2aa198;">'two'</span>, 2<span style="color: #9564bf;">)</span>, <span style="color: #9564bf;">(</span><span style="color: #2aa198;">'one'</span>, 1<span style="color: #9564bf;">)</span>, <span style="color: #9564bf;">(</span><span style="color: #2aa198;">'three'</span>, 3<span style="color: #9564bf;">)</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'two'</span>: 2, <span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'three'</span>: 3<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span><span style="color: #2aa198;">'three'</span>: 3, <span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'two'</span>: 2<span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'three'</span>: 3, <span style="color: #2aa198;">'one'</span>: 1, <span style="color: #2aa198;">'two'</span>: 2<span style="color: #8d5649;">}</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
