lang/python-distilled.org
** 键是否存在和迭代器
   =has_key= 在 Python3.x 中已经弃用，建议用 =in= 关键字判断是否在字典中。

   #+BEGIN_SRC python :exports code
     x = {'k1': 'val1', 'k2': 'val2'}
     x.has_key('k1') #>>> True
     x.has_key('c') #>>> False
     'k1' in x
   #+END_SRC

   #+BEGIN_SRC python :exports code
     x = {'k1': 'val1', 'k2': 'val2'}
     >>> x.items()
     dict_items([('k1', 'val1'), ('k2', 'val2')])
     >>> x.values()
     dict_values(['val1', 'val2'])
     >>> x.keys()
     dict_keys(['k1', 'k2'])

     for k, v in x.iteritems():
         pass
     for v in x.itervalues():
         pass
     for k in x.iterkeys():
         pass

   #+END_SRC

** 更新字典
   =update= 方法通过一个字典的内容来替换另外一个字典。

   #+BEGIN_SRC python :exports code
     >>> p1 = dict(x=0,y=0)
     >>> p1
     {'x': 0, 'y': 0}
     >>> p2 = dict(x=1, y=2)
     >>> p2
     {'x': 1, 'y': 2}
     >>> p1.update(p2)
     >>> p1
     {'x': 1, 'y': 2}
     >>> p2
     {'x': 1, 'y': 2}
     >>>
   #+END_SRC


** 获取字典的值

   =setdefault= 用于设置字典的默认值，如果元素存在则返回元素的值，并将值写入字典。
   =get= 方法有同样的取值效果，但是不会将字典中不存在的值写入字典中。

   #+BEGIN_SRC python :exports code
     >>> person = dict(name='Jinghui', age=18)
     >>> person
     {'name': 'Jinghui', 'age': 18}
     >>> person.setdefault('name', 'anonymous')
     'Jinghui'
     >>> person.setdefault('birthday', 'unknown')
     'unknown'
     >>> person
     {'name': 'Jinghui', 'age': 18, 'birthday': 'unknown'}
     >>> person['height']
     Traceback (most recent call last):
       File "<stdin>", line 1, in <module>
     KeyError: 'height'
     >>> person.setdefault('height', 120)
     120
     >>> person['height']
     120
     >>>
   #+END_SRC

* 参考链接

  1. [[https://docs.python-guide.org][The Hitchhiker’s Guide to Python!]]
  2. [[https://www.fullstackpython.com/][Full Stack Python]]
  3. [[https://docs.python.org/3/][Python3 Documentatnion]]
  4. [[https://docs.python.org/3/tutorial/index.html][Python3 Tutorial]]
  5. [[https://github.com/Jeanhwea/python-project-template][Python Project Template]]
  6. [[../article/05.setup-pip-envs.org][pip command]]
