lang/python-distilled.html

<div id="outline-container-org276a2eb" class="outline-3">
<h3 id="org276a2eb"><span class="section-number-3">5.4</span> 键是否存在和迭代器</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<code>has_key</code> 在 Python3.x 中已经弃用，建议用 <code>in</code> 关键字判断是否在字典中。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'k1'</span>: <span style="color: #2aa198;">'val1'</span>, <span style="color: #2aa198;">'k2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
x.has_key<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'k1'</span><span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">&gt;&gt;&gt; True</span>
x.has_key<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">&gt;&gt;&gt; False</span>
<span style="color: #2aa198;">'k1'</span> <span style="color: #859900;">in</span> x
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'k1'</span>: <span style="color: #2aa198;">'val1'</span>, <span style="color: #2aa198;">'k2'</span>: <span style="color: #2aa198;">'val2'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; x.items<span style="color: #8d5649;">()</span>
dict_items<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">(</span><span style="color: #2aa198;">'k1'</span>, <span style="color: #2aa198;">'val1'</span><span style="color: #9564bf;">)</span>, <span style="color: #9564bf;">(</span><span style="color: #2aa198;">'k2'</span>, <span style="color: #2aa198;">'val2'</span><span style="color: #9564bf;">)</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x.values<span style="color: #8d5649;">()</span>
dict_values<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #2aa198;">'val1'</span>, <span style="color: #2aa198;">'val2'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x.keys<span style="color: #8d5649;">()</span>
dict_keys<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #2aa198;">'k1'</span>, <span style="color: #2aa198;">'k2'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>

<span style="color: #859900;">for</span> k, v <span style="color: #859900;">in</span> x.iteritems<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>
<span style="color: #859900;">for</span> v <span style="color: #859900;">in</span> x.itervalues<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>
<span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> x.iterkeys<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org5c24de1" class="outline-3">
<h3 id="org5c24de1"><span class="section-number-3">5.5</span> 更新字典</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<code>update</code> 方法通过一个字典的内容来替换另外一个字典。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">p1</span> = <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>x=0,y=0<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; p1
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'x'</span>: 0, <span style="color: #2aa198;">'y'</span>: 0<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">p2</span> = <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>x=1, y=2<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; p2
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'x'</span>: 1, <span style="color: #2aa198;">'y'</span>: 2<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; p1.update<span style="color: #8d5649;">(</span>p2<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; p1
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'x'</span>: 1, <span style="color: #2aa198;">'y'</span>: 2<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; p2
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'x'</span>: 1, <span style="color: #2aa198;">'y'</span>: 2<span style="color: #8d5649;">}</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org09980c1" class="outline-3">
<h3 id="org09980c1"><span class="section-number-3">5.6</span> 获取字典的值</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<code>setdefault</code> 用于设置字典的默认值，如果元素存在则返回元素的值，并将值写入字典。
<code>get</code> 方法有同样的取值效果，但是不会将字典中不存在的值写入字典中。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">person</span> = <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>name=<span style="color: #2aa198;">'Jinghui'</span>, age=18<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; person
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jinghui'</span>, <span style="color: #2aa198;">'age'</span>: 18<span style="color: #8d5649;">}</span>
&gt;&gt;&gt; person.setdefault<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'anonymous'</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'Jinghui'</span>
&gt;&gt;&gt; person.setdefault<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'birthday'</span>, <span style="color: #2aa198;">'unknown'</span><span style="color: #8d5649;">)</span>
<span style="color: #2aa198;">'unknown'</span>
&gt;&gt;&gt; person
<span style="color: #8d5649;">{</span><span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jinghui'</span>, <span style="color: #2aa198;">'age'</span>: 18, <span style="color: #2aa198;">'birthday'</span>: <span style="color: #2aa198;">'unknown'</span><span style="color: #8d5649;">}</span>
&gt;&gt;&gt; person<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'height'</span><span style="color: #8d5649;">]</span>
Traceback <span style="color: #8d5649;">(</span>most recent call last<span style="color: #8d5649;">)</span>:
  File <span style="color: #2aa198;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #859900;">in</span> &lt;module&gt;
<span style="color: #268bd2;">KeyError</span>: <span style="color: #2aa198;">'height'</span>
&gt;&gt;&gt; person.setdefault<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'height'</span>, 120<span style="color: #8d5649;">)</span>
120
&gt;&gt;&gt; person<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'height'</span><span style="color: #8d5649;">]</span>
120
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org35514a4" class="outline-2">
<h2 id="org35514a4"><span class="section-number-2">6</span> 参考链接</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><a href="https://docs.python-guide.org">The Hitchhiker’s Guide to Python!</a></li>
<li><a href="https://www.fullstackpython.com/">Full Stack Python</a></li>
<li><a href="https://docs.python.org/3/">Python3 Documentatnion</a></li>
<li><a href="https://docs.python.org/3/tutorial/index.html">Python3 Tutorial</a></li>
<li><a href="https://github.com/Jeanhwea/python-project-template">Python Project Template</a></li>
<li><a href="../article/05.setup-pip-envs.html">pip command</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-23 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-07-02 Tue 11:55</p>
<p class="validation"></p>
</div>
</body>
</html>
